In [3]:
import pandas as pd
import numpy as np
# 读取泰坦尼克号生存预测分析测试1
test=pd.read_csv('DS_day03/code/data/test.csv',engine='python')
test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

**对数据进行描述性分析**

In [4]:
# 完整性分析
test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Pclass       418 non-null    int64
 2   Name         418 non-null    object
 3   Sex          418 non-null    object
 4   Age          332 non-null    float64
 5   SibSp        418 non-null    int64
 6   Parch        418 non-null    int64
 7   Ticket       418 non-null    object
 8   Fare         417 non-null    float64
 9   Cabin        91 non-null     object
 10  Embarked     418 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 36.0+ KB

In [5]:
test.shape

(418, 11)

In [6]:
# 数值型数据描述性分析
test.describe()

       PassengerId      Pclass         Age       SibSp       Parch        Fare
count   418.000000  418.000000  332.000000  418.000000  418.000000  417.000000
mean   1100.500000    2.265550   30.272590    0.447368    0.392344   35.627188
std     120.810458    0.841838   14.181209    0.896760    0.981429   55.907576
min     892.000000    1.000000    0.170000    0.000000    0.000000    0.000000
25%     996.250000    1.000000   21.000000    0.000000    0.000000    7.895800
50%    1100.500000    3.000000   27.000000    0.000000    0.000000   14.454200
75%    1204.750000    3.000000   39.000000    1.000000    0.000000   31.500000
max    1309.000000    3.000000   76.000000    8.000000    9.000000  512.329200

In [7]:
test['Age'].describe()

count    332.000000
mean      30.272590
std       14.181209
min        0.170000
25%       21.000000
50%       27.000000
75%       39.000000
max       76.000000
Name: Age, dtype: float64

In [8]:
# 类别型数据描述性分析
test['Sex'].value_counts()

male      266
female    152
Name: Sex, dtype: int64

In [10]:
# 分析登船港口
test['Embarked'].value_counts(0)

S    270
C    102
Q     46
Name: Embarked, dtype: int64

In [13]:
# 类别型数据的描述性分析
test.select_dtypes('int64').describe().T

,count,mean,std,min,25%,50%,75%,max
PassengerId,418.0,1100.500000,120.810458,892.0,996.25,1100.5,1204.75,1309.0
Pclass,418.0,2.265550,0.841838,1.0,1.00,3.0,3.00,3.0
SibSp,418.0,0.447368,0.896760,0.0,0.00,0.0,1.00,8.0
Parch,418.0,0.392344,0.981429,0.0,0.00,0.0,0.00,9.0

In [14]:
test.select_dtypes('float64').describe().T

      count       mean        std   min      25%      50%   75%       max
Age   332.0  30.272590  14.181209  0.17  21.0000  27.0000  39.0   76.0000
Fare  417.0  35.627188  55.907576  0.00   7.8958  14.4542  31.5  512.3292